<html>
  <body>

    
<h2>Writer2QML Hilfe</h2>

<p><strong>Einf&uuml;hrung</strong></p>

<p>Writer2Qml konvertiert Frageb&ouml;gen, die mit dem Textverarbeitungsprogramm OpenOffice Writer geschrieben sind, in das Format der Questionnaire Markup Language (QML, siehe http://qml.uni-siegen.de/de). Damit eine Konvertierung m&ouml;glich ist, m&uuml;ssen die Frageb&ouml;gen unter Verwendung der QML-Formatvorlagen f&uuml;r Writer geschrieben werden. Die in das QML-Format &uuml;bertragenen Frageb&ouml;gen k&ouml;nnen genutzt weden, um mit geringem Aufwand Online Befragungen anzulegen.</p>

<p>Eine Anleitung zur Erstellung von Writer Dateien mit den QML-Formatvorlagen f&uuml;r Writer finden Sie auf der QML-Homepage (http://qml.uni-siegen.de/de).</p>

<p><strong>Konvertieren von Writer Dateien</strong></p>

<p>Um eine Writer Datei zu konvertieren, w&auml;hlen Sie im Men&uuml; Datei * Writer Datei konvertieren oder w&auml;hlen Sie alternativ das entsprechende Symbol auf der Werkzeugleiste. W&auml;hlen Sie in dem daraufhin ge&ouml;ffneten Dateiauswahldialog die Writerdatei aus, die Sie konvertieren m&ouml;chten (Dateiendung ".odt") und best&auml;tigen Sie Ihre Auswahl.</p>

<p>Falls die zu konvertierende Datei keine Fehler enth&auml;lt, wird sie in direkt in das QML-Format konvertiert und gespeichert. </p>

<p><u>Die erzeugte QML-Datei wird dabei automatisch im Verzeichnis der Writerdatei gespeichert, wobei an den Dateinamen der Writerdatei ein ".xml" angeh&auml;ngt wird.</u> Die QML Datei zur Writer Datei "Fragebogen.odt" wird also unter dem neuen Namen "Fragebogen.odt.xml" gespeichert.</p>

<p>Falls Die zu konvertierende Datei Fehler enth&auml;lt, werden diese im Tab "Meldungen Writerimport" angezeigt. Wenn Sie die fehlerhaften Formatzuweisungen in der Writer Datei korrigiert und diese gespeichert haben, k&ouml;nnen Sie die Datei durch Auswahl des Symbols "Aktuelle Writerdatei wieder einlesen" erneut zur Konvertierung einlesen.</p>

<p><strong>Meldungen zum Import der Frageb&ouml;gen</strong></p>

<p>Im Tab Meldungen Writerimport werden Statusmeldungen zum Import der Writerdatei angezeigt. Das Fenster ist zweigeteilt. Die rechte Seite zeigt eine Übersicht zu den importierten Abs&auml;tzen der Writer Datei. Zu jedem Absatz wird eine fortlaufende Absatznummer, der Typ des Absatzes und der Text des Absatzes angezeigt. Im Fehlerfall wird an der entsprechenden Stelle ein Hinweis zur Art des Fehlers ausgegeben.</p>

<p>In der Navigationsansicht auf der Linken Seite werden die Absatznummern fehlerhaft zugewiesener Absatzformate angezeigt. Nach einem Klick auf die entsprechende Absatznummer springt die Ansicht auf der rechten Seite zur entsprechenden Stelle.</p>

<p><strong>QML Ausgabe</strong></p>

<p>Im Tab "Qml Ausgabe" wird die erzeugte QML-Datei in einem Textbetrachter angezeigt. Die Datei braucht nicht mehr gespeichert zu werden, dies geschieht automatisch (s.o. Konvertieren von Writer Dateien).</p>

<p><strong>HTML-Ausgabe</strong></p>
<p>Nach erfolgreicher Konvertierung wird im Tab "HTML Ausgabe" eine HTML Ansicht des Fragebogens angezeigt. Diese Ansicht bietet eine Vorschau auf das Aussehen des Online-Fragebogens, wie sie durch das Hochladen der QML-Datei auf den QML-Befragungsserver erzeugt wird.</p>



  </body>
</html>